app/controllers/toys_controller.rb

SELECT  "toys".* FROM "toys"  WHERE "toys"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "toys" SET "pokemon_id" = $1, "updated_at" = $2 WHERE "toys"."id" = 1  [["pokemon_id", 12], ["updated_at", "2015-06-02 18:35:52.016116"]]
---
  def update
    @toy = Toy.find(params[:id])
    if @toy.update(toy_params)